DRT_GLOBLE = {
  VERSION = "v11.4",
}

--- 地下堡 PIO id, 查询当日的丰裕地下堡
--- POI ID 查询: https://wago.tools/db2/areapoi?build=11.2.0.62493&locale=zhCN
--- cmd: /dump C_AreaPoiInfo.GetAreaPOIInfo(2339, 7898) -- 获取地图信息
--- cmd: /dump C_AreaPoiInfo.GetDelvesForMap(2371)      -- 获取地下堡ID
DRT_DELVES_POI_IDS = {
  -- 多恩岛
  [7787] = { ["zone"] = 2248 },   -- 地铺矿洞
  [7779] = { ["zone"] = 2248 },   -- 真菌之愚
  [7781] = { ["zone"] = 2248 },   -- 克莱格瓦之眠
  -- 喧鸣深窟
  [7782] = { ["zone"] = 2214 },   -- 水能堡
  [7788] = { ["zone"] = 2214 },   -- 恐惧陷坑
  [8181] = { ["zone"] = 2214 },   -- 九号挖掘场
  -- 陨圣峪
  [7780] = { ["zone"] = 2215 },   -- 丝菌师洞穴
  [7785] = { ["zone"] = 2215 },   -- 夜幕圣所
  [7783] = { ["zone"] = 2215 },   -- 无底沉穴
  [7789] = { ["zone"] = 2215 },   -- 飞掠裂口
  -- 艾基
  -- "The Spiral Weave"
  [7790] = { ["zone"] = 2255 },   -- 螺旋织纹
  [7784] = { ["zone"] = 2255 },   -- 塔克雷桑
  [7786] = { ["zone"] = 2255 },   -- 幽暗要塞
  -- 安德麦
  [8246] = { ["zone"] = 2346 },   -- 闸板陋巷
  -- 卡雷什
  [8273] = { ["zone"] = 2371 },   -- 档案馆突袭
  [8323] = { ["zone"] = 2371 },   -- 虚空之锋庇护所

}

---地下堡列表, 用于下拉列表显示地下堡的名称
---cmd: /dump C_Map.GetMapInfo(2252) 获取地图名称
---cmd: /dump C_Map.GetMapChildrenInfo(2255) 获取子地图名称
---cmd: /dump C_Map.GetBestMapForUnit("player") 获取当前用户所在地图名称
DRT_DELVES_ID = {
  -- 2274 卡加阿兹
  -- 2248 多恩岛
  2249,   -- 真菌之愚
  2250,   -- 克莱格瓦之眠
  2269,   -- 地匍矿洞
  -- 2214 喧鸣深窟
  2251,   -- 水能堡
  2302,   -- 恐惧陷坑
  2396,   -- 九号挖掘场
  -- 2215 陨圣峪
  2277,   -- 夜幕圣所
  2301,   -- 无底沉穴
  2310,   -- 飞掠裂口
  2312,   -- 丝菌师洞穴
  -- 2255 艾基
  2299,   -- 幽暗要塞
  2314,   -- 塔克-雷桑深渊
  2347,   -- 螺旋织纹
  -- 2346 安德麦
  2423,   -- 闸板陋巷
  -- 2371 卡雷什
  2476,   -- 档案馆突袭 (2454 / )
  2484,   -- 虚空之锋庇护所
}

--- dele
DRT_DELVE_TIERS = {
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11
}

DRT_DELVE_TREASURE_MAP_ICON = {
  ["11.1"] = "Icon_treasuremap",
  ["11.2"] = "Inv_enchanting_crystal"
}
